const lesson1 = [
    {
      title: 'Заняття 1',
      subtitle: 'Вступ до логічного мислення. Логіка побудови мови',
      content: [
        '1. Що таке логіка? Як пов’язані логіка та логічне мислення?',
        '2. Як працює мозок, коли зіштовхується з логічними завданнями?',
        '3. Що таке судження і як вони бувають?',
        '4. Елементи мови. Закономірності, які можна відслідкувати у будь-якій мові.',
        '5. Лінгвістика як напрям розвитку логічного мислення.'
      ]
    },
    { title: 'Заняття 2', subtitle: 'Дедукція: аналіз інформації та формування висновків', content: [
      "1. Дедуктивне мислення, яке застосовують у детективах.",
      "2. Основні елементи мислення.",
      "3. Закони логіки.",
      "4. Що таке умовивід і як формуються припущення?",
      "5. Детально про процес міркування: силогізми та доведення."
    ] },
    { title: 'Заняття 3', subtitle: 'Індукція: формування правдивих та неправдивих суджень', content: [
      "1. Індукція та Дедукція: у чому відмінність?",
      "2. Як міркувати індуктивно? Аналіз вхідної інформації.",
      "3. Перевірка інформації на правдивість за допомогою індукції.",
      "4. Індукція у математиці. Математичні задачі.",
      "5. Базові природничі задачі, які вирішуються методом індукції."
    ] },
    { title: 'Заняття 4', subtitle: 'Причинно-наслідковий зв’язок: пошук та побудова', content: [
      "1. Аналіз ситуації. Встановлення причинно-наслідкового зв'язку.",
      "2. Правила, які допомагають відшукати джерело ситуації.",
      "3. Як шукати аналоги та будувати аналогії?",
      "4. Відмінність аналогії та асоціації.",
      "5. Що таке абдукція? Використання абдукції у задачах."
    ] },
    { title: 'Заняття 5', subtitle: 'Логічні принципи у житті: практика', content: [
      "1. Методика ТРІЗ. Вирішення винахідницьких задач.",
      "2. Чи присутня логіка у філософії? Філософія як спосіб розвитку логічного мислення.",
      "3. Вирішення задач, які часто зустрічаються у житті.",
      "4. Вирішення задач, які рідко зустрічаються у житті."
    ] },
    { title: 'Заняття 6', subtitle: 'Побудова комунікації. Елементи комунікації', content: [
      "1. Головні елементи комунікації.",
      "2. Як доводити та спростовувати думки?",
      "3. Як керувати розмовою? Логіка побудови аргументів.",
      "4. Розбір різних ситуацій: протилежні думки, переконання, приєднання.",
      "5. Гра у дебати."
    ] },
    { title: 'Заняття 7', subtitle: 'Критичний аналіз. Вплив ЗМІ', content: [
      "1. Критичне та логічне мислення: відмінності.",
      "2. Аналіз різних видів інформації: текст, відео, звук.",
      "3. Що таке критерій точності і чому він важливий для критичного аналізу інформації?",
      "4. Види маніпуляцій. Логіка побудови маніпуляцій.",
      "5. Медіаграмотність як основа критичного та логічного мислення"
    ] },
    { title: 'Заняття 8', subtitle: 'Логіка у науці', content: [
      "1. Пошук проблеми. Формулювання гіпотези.",
      "2. Як будують теорії?",
      "3. Логічні принципи у фізиці, біології, хімії, географії, економіці.",
      "4. Наука та лженаука: як розрізнити?",
      "5. Чому логіка та наука не дають відповідь на всі запитання?"
    ] },
    { title: 'Заняття 9', subtitle: 'Логічне мислення як вид інтелекту(ів)', content: [
      "1. Розумовий інтелект (IQ)",
      "2. Емоційний (EQ), тілесний (BQ) та інші види інтелектів.",
      "3. Взаємозв'язок між мисленням та інтелектом.",
      "4. Як розвивати інтелекти?",
      "5. Роль логічного мислення у освіченості людини."
    ] },
    { title: 'Заняття 10', subtitle: 'Побудова логічних задач', content: [
      "1. З чого складається задача, яка її структура?",
      "2. Формулювання умови: на що потрібно звертати увагу?",
      "3. Відмінність звичайних та логічних задач.",
      "4. Аналіз власних задач студентів.",
      "5. Вирішення задач студентів."
    ] },
];

export const lesson2 = [
    {
      title: 'Заняття 1',
      subtitle: 'Як з\'являлись мови програмування? Перші програми',
      content: [
        '1. Чому саме мова С змінила підхід до програмування?',
        '2. Що таке парадигма і наскільки важлива вона в програмуванні?',
        '3. Технологія навчання програмуванню: Три кроки до коду.',
        '4. Програмуємо: "Привіт, світ!" і говоримо "я новий програміст".',
        '5. Перші програми. Проста арифметика.',
        '6. Бібліотеки.'
      ]
    },
    {
      title: 'Заняття 2',
      subtitle: 'Вибір у програмах: приклади та кодування',
      content: [
        '1. Умови: прості, складні.',
        '2. Логіка коду: розбираємо послідовність роботи програми.',
        '3. Працюємо з даними. Створюємо дані.',
        '4. Особливості введення - виведення даних.',
        '5. А ви знали, чому помилки - це добре?'
      ]
    },
    {
      title: 'Заняття 3',
      subtitle: 'Програмування процесів, які повторюються',
      content: [
        '1. Блоки коду. Чи можна блоки міняти місцями?',
        '2. Створюємо циклічні програми.',
        '3. Повторюємо фрагменти коду.',
        '4. Чи такі вже складні алгоритми?'
      ]
    },
    {
      title: 'Заняття 4',
      subtitle: 'Тестування програм',
      content: [
        '1. Поєднуємо три алгоритмічні структури в коді.',
        '2. Робота з тестовою системою.',
        '3. Які бувають алгоритмічні структури?',
        '4. Чому код починається з алгоритму?',
        '5. Створення ігрових стратегій.'
      ]
    },
    {
      title: 'Заняття 5',
      subtitle: 'Функції та параметри. Створення складних програм',
      content: [
        '1. Що таке функції? Функції важливі.',
        '2. Використання параметрів та змінних.',
        '3. Параметри — це просто.',
        '4. Створюємо власні функції.',
        '5. Поєднання декількох функцій.'
      ]
    },
    {
      title: 'Заняття 6',
      subtitle: 'Структурування даних',
      content: [
        '1. Масиви. Що таке масив?',
        '2. Навіщо потрібні масиви?',
        '3. А без них можна? А, не можна…',
        '4. Чому без масивів не може обійтись game_dev?'
      ]
    },
    {
      title: 'Заняття 7',
      subtitle: 'Робота з рядками і символами',
      content: [
        '1. Рядки і символи. Як з ними боряться програмісти?',
        '2. Які коди ховаються за клавішами?',
        '3. Що можна робити з символами?',
        '4. Звідки починаються шифри?'
      ]
    },
    {
      title: 'Заняття 8',
      subtitle: 'Робота з файлами',
      content: [
        '1. Типи файлів.',
        '2. Файлове введення-виведення.',
        '3. Шифрування даних.',
        '4. Вирішення задач.'
      ]
    },
    {
      title: 'Заняття 9',
      subtitle: 'Об\'єктно-орієнтоване програмування',
      content: [
        '1. Поняття парадигм програмування.',
        '2. "Все в світі є об\'єкт".',
        '3. Поняття класу та об\'єкту.',
        '4. Проектуємо світи.'
      ]
    },
    {
      title: 'Заняття 10',
      subtitle: 'Принципи ООП',
      content: [
        '1. Три кити, на яких тримається програмування.',
        '2. Використання ООП підходу проектування ігрового сюжету.',
        '3. Створення власної гри.',
        '4. Тестування ігор.'
      ]
    }
];

export const lesson3 = [
    {
      title: 'Заняття 1',
      subtitle: 'Креативність як основа інновацій у світі',
      content: [
        '1. Що таке креативність?',
        '2. У яких сферах діяльності використовують креатив?',
        '3. Приклади креативних проєктів у різних сферах діяльності.',
        '4. Вправи на розвиток креативності.'
      ]
    },
    {
      title: 'Заняття 2',
      subtitle: 'Якості креативних людей',
      content: [
        '1. Як визначити найкреативнішу людину?',
        '2. Перевірка на креативність: якості, навички.',
        '3. Чи впливають на креативні процеси знання, фантазія, мотивація, середовище, культура?',
        '4. Що відбувається, коли різні креативні люди об\'єднуються в команду?'
      ]
    },
    {
      title: 'Заняття 3',
      subtitle: 'Прояв креативності у мистецтві',
      content: [
        '1. Наш творчий мозок: перевірка на креативність.',
        '2. Етапи розвитку креативності.',
        '3. Мистецтво. Художники. Види художніх стилів.',
        '4. Чи все є мистецтвом: Архітектура, Скульптура...'
      ]
    },
    {
      title: 'Заняття 4',
      subtitle: 'Креативні сфери: Музика та Театр',
      content: [
        '1. Розвиток креативності через розуміння музики.',
        '2. Незвичайне мистецтво: театр, кіно, опера.',
        '3. Життєвий досвід розвитку в сфері мистецтва.',
        '4. Креативність vs Творчість vs Мистецтво.'
      ]
    },
    {
      title: 'Заняття 5',
      subtitle: 'Роль креативності у глобальних змінах',
      content: [
        '1. Цінності, місія, ціль компаній та проєктів.',
        '2. Як креативний підхід допомагає вирішувати великі проблеми?',
        '3. Цілі сталого розвитку. Об\'єднання задля кращого життя.',
        '4. Цінності відомих людей та їхній вплив на суспільство.'
      ]
    },
    {
      title: 'Заняття 6',
      subtitle: 'Методи створення креативних рішень',
      content: [
        '1. Мислення «out of box» чи все ж таки «in box»?',
        '2. Методи та поради для генерування креативних рішень.',
        '3. Погляд на звичайне по-новому.',
        '4. Практика: аналіз та перевірка власних ідей.'
      ]
    },
    {
      title: 'Заняття 7',
      subtitle: 'Креативність та бізнес',
      content: [
        '1. Креативність як складова успіху компаній.',
        '2. Креативні агенції та їхній вклад у розвиток індустрій.',
        '3. Етапи створення проєкту. Дизайн-мислення.',
        '4. Створення нових бізнес-ідей.'
      ]
    },
    {
      title: 'Заняття 8',
      subtitle: 'Великі мрії та глобальне мислення',
      content: [
        '1. Хто такі мрійники?',
        '2. Стратегія блакитного океану. Як змінюються мрії?',
        '3. Чому деякі мрії збуваються, а інші — ні?',
        '4. Візуалізація та втілення задумів із застосуванням креативності.'
      ]
    },
    {
      title: 'Заняття 9',
      subtitle: 'Скільки коштує креативність?',
      content: [
        '1. Які професії пов\'язані з креативом?',
        '2. Чим займаються креативні директори?',
        '3. Попит на креатив на світових платформах.',
        '4. Креативні відділи у великих компаніях.'
      ]
    },
    {
      title: 'Заняття 10',
      subtitle: 'Як розвивати і підтримувати креативність?',
      content: [
        '1. Як креативити: генерація ідей, дизайн, збереження суті.',
        '2. Не зупиняємось креативити. Де черпати натхнення?',
        '3. Вправи на перетворення звичайних ідей та проєктів у креативні.',
        '4. Як продовжити розвивати креативність?'
      ]
    },
    {
        title: 'Практика (у форматі конференції)',
        subtitle: 'Представлення власного креативного проєкту',
        content: []
    },
];

export const lesson4 = [
    {
      title: 'Заняття 1',
      subtitle: 'Розмітка веб-сторінки',
      content: [
        '1. Що таке веб-сайт?',
        '2. Основні елементи веб-сайту.',
        '3. Відмінності та задачі HTML, CSS, JavaScript.',
        '4. Створення першої текстової веб-сторінки.',
        '5. Огляд функціоналу веб-сторінок.',
        '6. Головні теги веб-сторінок.'
      ]
    },
    {
      title: 'Заняття 2',
      subtitle: 'Робота з текстом та зображеннями',
      content: [
        '1. Модифікація тексту за допомогою CSS.',
        '2. Створення абзаців та стилізація тексту.',
        '3. Робота з зображеннями: теги, атрибути, стилі.',
        '4. Що можна дізнатись по коду веб-сторінки?',
        '5. Особливості поєднання HTML-розмітки та CSS стилів.'
      ]
    },
    {
      title: 'Заняття 3',
      subtitle: 'Створення меню сторінки',
      content: [
        '1. Різновиди меню та їхнє написання.',
        '2. Адаптація меню під "бургер".',
        '3. Додавання CSS для меню.',
        '4. Створення підменю.'
      ]
    },
    {
      title: 'Заняття 4',
      subtitle: 'Анімація елементів на сторінці',
      content: [
        '1. Як використовувати JavaScript?',
        '2. Створення виліту елементів.',
        '3. Рух навколо осі, поява та зникнення елементів.',
        '4. Як відтермінувати появу об\'єкту на сторінці?'
      ]
    },
    {
      title: 'Заняття 5',
      subtitle: 'Створення списків. Тригери',
      content: [
        '1. Створення списків на сторінці.',
        '2. Створення прихованих елементів.',
        '3. Тригери та їхнє програмування.'
      ]
    },
    {
      title: 'Заняття 6',
      subtitle: 'Як налаштовувати SEO оптимізацію. Домен',
      content: [
        '1. Що таке SEO?',
        '2. Які бувають домени?',
        '3. Тестування різних доменів та швидкість роботи веб-сайту.',
        '4. Перевірка індексації веб-сторінок у інтернеті.'
      ]
    },
    {
      title: 'Заняття 7',
      subtitle: 'Створення push-повідомлень. Шаблони',
      content: [
        '1. Навіщо потрібні push-повідомлення на веб-сайті?',
        '2. Які дані про користувачів може збирати веб-сайт?',
        '3. Використання шаблонів сайтів.',
        '4. Адаптація шаблонів під проект.'
      ]
    },
    {
      title: 'Заняття 8',
      subtitle: 'Створення та редагування інших елементів сайту',
      content: [
        '1. Додавання форм зворотного зв\'язку.',
        '2. Вставка відео та медіа-елементів.',
        '3. Створення інтерактивних блоків.'
      ]
    },
    {
      title: 'Заняття 9',
      subtitle: 'Робота з компонентами: кнопки, форми, лейаути',
      content: [
        '1. Створення кнопок і форм з CSS.',
        '2. Валідація форм.',
        '3. Позиціонування блоків і створення макета сторінки.'
      ]
    },
    {
      title: 'Заняття 10',
      subtitle: 'Як веб-програмісту оформляти портфоліо?',
      content: [
        '1. Платформи для веб-розробників.',
        '2. Ресурси з прикладами дизайнів та функціоналу веб-сайтів.',
        '3. Представлення власного веб-сайту.',
        '4. Де вчитись далі або як набратись практики.'
      ]
    }
  ];
  
const lesson6 = [
    {
      title: 'Заняття 1',
      subtitle: 'Вступ до фізики. Механіка',
      content: [
        "1. Чому будують теорію і як поставити експеримент?",
        "2. диниці вимірювання. Навіщо нам система СІ та що було до неї?",
        "3. Скаляр і вектор. Чому фізик має це знати?",
        "4. Матеріальна точка та її рух. Незалежність вертикальної та горизонтальної компоненти.",
        "5. Прості механізми. Чи може людина підняти 100 тонн? Золоте правило механіки.",
        "6. Закон всесвітнього тяжіння. Чому австралійці не падають з Південної півкулі?",
        "7. Закони Ньютона. «Інша» маса. Чому вага у ньютонах, а терези показують кілограми?",
        "8. Закон руху центру мас: як не падати в метро та на скейтборді.",
        "9. Повна механічна енергія (кінетична та потенціальна). Робота і потужність: в чому відмінність?"
      ]
    },
    {
      title: 'Заняття 2',
      subtitle: 'Механічні коливання та хвилі',
      content: [
        "1. Коливання — найрозповсюдженіший вид руху у природі?",
        "2. Маятники: математичний і фізичний. Маятник Фуко та де його можна побачити в Україні?",
        "3. Звук і резонанс: як вони діють у музичних інструментах і впливають на руйнування мостів?",
        "4. Різниця між гіроскопами і гороскопами. Зв'язок між обертанням, прецесією та нутацією.",
        "5. Чому Земля обертається? Як будують залізницю, та чому у річок один берег пологий, а інший крутий?",
        "6. Вплив Місяця на Землю. Чому нашій планеті потрібен супутник? У чому помилявся Галілей?",
        "7. Знайомство з релятивістською механікою та «нездоланною» швидкістю."
      ]
    },
    {
      title: 'Заняття 3',
      subtitle: 'Термодинаміка',
      content: [
        "1. Вступ до термодинаміки. Що це таке і чому люди почали її окремо вивчати? Закон Архімеда.",
        "2. Температура. Нульовий закон термодинаміки. Як з'явився термометр? Чому ми користуємося шкалою Цельсія і Фаренгейта, фізики — Кельвіна, а про шкали Ньютона і Реомера ніхто не чув?",
        "3. Теплота та теплорід: хто переміг? Калорія та джоуль. Внутрішня енергія. Перший закон термодинаміки.",
        "4. Ідеальний газ. Як пов'язані тиск, температура та об'єм? Наскільки «ізі» ізопроцеси?",
        "5. ККД. Цикл Карно. Як працює двигун автомобіля? Цикли Отто, Дизеля.",
        "6. Другий закон термодинаміки. Ентропія — міра хаосу. Чому у нашого світу має бути «теплова смерть», проте цього ніколи не станеться?",
        "7. Вічний двигун. Чому їх є два, але ми не збудували жодного?"
      ]
    },
    {
      title: 'Заняття 4',
      subtitle: 'Молекулярна фізика',
      content: [
        "1. Будова речовини. Що таке молекула та чому ми про це говоримо? Основні поняття молекулярної фізики. Число Авогадро.",
        "2. Тиск та температура. Чому у горах більше люблять смажене м'ясо, а не чай?",
        "3. Основні агрегатні стани речовини. Чи можна випити повітря? Потрійна точка.",
        "4. Молекули-спортсмени: довжина вільного пробігу. Дифузія. Осмос.",
        "5. Реальний газ. Відмінність від «ідеального». Який вигляд має тепловий рух?",
        "6. Поверхневий натяг. Чому крапля кругла, а водомірки бігають по воді?",
        "7. Деформація: чому не виготовляють м'ячі з пластиліну та дерева?"
      ]
    },
    {
      title: 'Заняття 5',
      subtitle: 'Електрика та магнетизм',
      content: [
        "1. Електричний заряд. Закон Кулона — «тяжіння» в електриці. Силові лінії.",
        "2. Постійний струм. Провідники: чому вони в електриці, а не в електричці?",
        "3. Напівпровідники. Як вони допомогли нашому телефону? Діелектрики, сегнетоелектрики, п'єзоелектрики: скільки електриків, стільки думок.",
        "4. Змінний струм. Чому він з'явився? Чому у розетках можна побачити саме 220 В та 380 В?",
        "5. Електричний струм у рідинах та газах. Як працюють акумулятор та батарейка? Види розрядів: коронний, дуговий, іскровий, тліючий.",
        "6. Магнітне поле та зв'язок з електрикою. Феро-, пара- та діамагнетики.",
        "7. Надпровідність та потяги майбутнього. Четвертий стан речовини — плазма."
      ]
    },
    {
      title: 'Заняття 6',
      subtitle: 'Оптика',
      content: [
        "1. Історія оптики. Чому з очей все ж таки не лізуть «промені-щупальці»?",
        "2. Дзеркала та лінзи. Чи міг Архімед спалити флот? Принцип роботи телескопа, мікроскопа, фотоапарата. Як бачить людське око?",
        "3. Дифракція, інтерференція, поляризація, дисперсія та інші страшні слова. Як утворюється веселка і чи можна їх побачити декілька одночасно?",
        "4. Світло. Чому існує «дуалізм»? Швидкість світла. Методи його вимірювання. Довжина хвилі. Кольори. Інше світло.",
        "5. Лазери. Де їх використовують? Голограми та їхнє виготовлення.",
        "6. Сонце. Чому у нас є літо та зима, тропіки та полярне коло? Полярне сяйво.",
        "7. Ефект Доплера та чому ми знову говоримо про звук?"
      ]
    },
    {
      title: 'Заняття 7',
      subtitle: 'Атомна та ядерна фізика. Фізика елементарних частинок',
      content: [
        "1. Фундамент світу: молекули, атоми, нуклони. Будова атома. Модель атома Бора.",
        "2. Зв'язок фізики та хімії. Хімічні елементи та їх розповсюдженість у природі. Таблиця Менделєєва.",
        "3. Радіоактивність. Відкриття Беккереля та Кюрі. Види розпаду: альфа, бета та гама. Рентгенівське випромінювання. Напіврозпад.",
        "4. Енергія розпадів. Атомні електростанції. Інші способи використання атомної та ядерної енергії. Термоядерний синтез.",
        "5. Будова ядра. Чому кварки не «квакають»? Прискорювачі заряджених частинок. Інші елементарні частинки"
      ]
    },
    {
      title: 'Заняття 8',
      subtitle: 'Квантова фізика',
      content: [
        "1. Знайомство з квантовою фізикою. Причини її появи. Що таке постулати та з чим їх їсти?",
        "2. Кіт Шредінгера: що з ним сталося і чому про нього усі говорять?",
        "3. Фотони. Фотоефект: за що Ейнштейн отримав Нобелівську премію? Тиск світла і як його виміряти.",
        "4. Чи можна подолати швидкість світла та чому всі думають, що це неможливо?",
        "5. Квантова механіка. Що спільного зі звичайною (класичною) та чому ми вже не користуємось нею?",
        "6. Квантова теорія поля. Складні речі простими словами. Як від неї перейти до ядерної фізики?"
      ]
    },
    {
      title: 'Заняття 9',
      subtitle: 'Теорія відносності. Спеціальна та загальна. Космологія',
      content: [
        "1. Спеціальна теорія відносності: межа для класичної і квантової механіки. Перетворення Лоренца.",
        "2. Ейнштейн руйнує розуміння світу: загальна теорія відносності. Чому ми живемо у чотиривимірному просторі?",
        "3. Космос та причини його вивчення. Планети, зорі, комети, метеорити, метеори. Сонячна система та Всесвіт поза нею.",
        "4. Історія трансформації уявлень про модель Всесвіту.",
        "5. Космічні промені та історія появи Всесвіту.",
        "6. Чорні діри. Горизонт подій.",
        "7. Темна матерія."
      ]
    },
    {
      title: 'Заняття 10',
      subtitle: 'Сучасна фізика. Фізика майбутнього. Лайфхаки',
      content: [
        "1. Принципи Всесвіту: причинності, близькодії та далекодії, принцип невизначеності Ейнштейна.",
        "2. Симетрія у фізиці. Чому вона настільки важлива? Порушення симетрії. Спроби побудови загальної теорії для Всесвіту.",
        "3. Чи все вже вивчили фізики? Актуальні теми сьогодення.",
        "4. Історія Нобелівських премій із фізики. За які досягнення їх отримували раніше і за які отримують зараз?",
        "5. Префікс «нано» ще модний чи вже потрібно використовувати інший?",
        "6. Лайфхаки з фізики, якими кожен може користуватись у себе вдома.",
      ]
    },
]

export const coursesProgram = [
    lesson1,
    lesson2,
    lesson3,
    lesson4,
    lesson6,
]